gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Calculer la moyenne actuelle        
  int currentAverage = sum / IR_SAMPLE_SIZE;        
          
  // Vérifier si la nouvelle valeur est aberrante        
  int deviation = abs(newValue - currentAverage);        
          
  if (deviation > IR_MAX_DEVIATION) {        
    // Valeur aberrante : la limiter à moyenne ┬▒ seuil        
    int limitedValue;        
    if (newValue > currentAverage) {        
      limitedValue = currentAverage + IR_MAX_DEVIATION;        
    } else {        
      limitedValue = currentAverage - IR_MAX_DEVIATION;        
    }        
            
    // Mettre à jour le buffer avec la valeur limitée        
    sum -= buffer[index];        
    buffer[index] = limitedValue;        
    sum += limitedValue;        
  } else {        
    // Valeur normale : l'ajouter au buffer        
    sum -= buffer[index];        
    buffer[index] = newValue;        
    sum += newValue;        
  }        
          
  // Passer à l'index suivant (buffer circulaire)        
  index = (index + 1) % IR_SAMPLE_SIZE;        
          
  // Retourner la moyenne        
  return sum / IR_SAMPLE_SIZE;        
}        
        
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status)        
{        
  // Callback pour le statut d'envoi (optionnel)        
}        
        
        
        
// Fonction pour mettre à jour un paramètre par son nom        
void setParameter(const char* paramName, uint8_t value) {        
  for (int i = 0; i < PRESET_SIZE; i++) {        
    if (strcmp(parameters[i].name, paramName) == 0) {        
      // Vérifier si c'est le paramètre pitch (indice 1)        
      if (i == 1) { // pitch        
        // Appliquer la transposition        
        int transposedValue = (int)value + (transpose * transpose_factor);        
                
        // Limiter la valeur entre 0 et 255        
        if (transposedValue < 0) transposedValue = 0;        
        if (transposedValue > 255) transposedValue = 255;        
                
        parameters[i].value = (uint8_t)transposedValue;        
        // Mettre à jour le tableau DMX        
        dmxValues[parameters[i].dmxChannel - 1] = (uint8_t)transposedValue;        
                
        // Debug de la transposition        
        // Serial.print("Pitch transposé: ");        
        // Serial.print(value);        
        // Serial.print(" + (");        
        // Serial.print(transpose);        
        // Serial.print(" ├ù ");        
        // Serial.print(transpose_factor);        
        // Serial.print(") = ");        
        // Serial.println(transposedValue);        
      } else {        
        // Pour les autres paramètres, comportement normal        
        parameters[i].value = value;        
        // Mettre à jour le tableau DMX        
        dmxValues[parameters[i].dmxChannel - 1] = value;        
      }        
      return;        
    }        
  }        
  //Serial.println("Paramètre " + String(paramName) + " non trouvé");        
}        
        
// Fonction pour mettre à jour le gate_threshold avec la transposition        
void updateGateThresholdWithTranspose() {        
  // Récupérer la valeur par défaut du preset pour gate_threshold        
  uint8_t originalGateThreshold = presets[selectedPreset].values[7]; // indice 7 = gate_threshold        
          
  // Appliquer la transposition        
  int transposedGateThreshold = (int)originalGateThreshold + (transpose * transpose_factor);        
          
  // Limiter la valeur entre 0 et 255        
  if (transposedGateThreshold < 0) transposedGateThreshold = 0;        
  if (transposedGateThreshold > 255) transposedGateThreshold = 255;        
          
  // Mettre à jour le paramètre        
  parameters[7].value = (uint8_t)transposedGateThreshold;        
  dmxValues[parameters[7].dmxChannel - 1] = (uint8_t)transposedGateThreshold;        
          
  // Debug        
  Serial.print("Gate threshold ajusté: ");        
  Serial.print(originalGateThreshold);        
  Serial.print(" + (");        
  Serial.print(transpose);        
  Serial.print(" ├ù ");        
  Serial.print(transpose_factor);        
  Serial.print(") = ");        
  Serial.print(transposedGateThreshold);        
  Serial.print(" (DMX canal ");        
  Serial.print(parameters[7].dmxChannel);        
  Serial.print(", index DMX ");        
  Serial.print(parameters[7].dmxChannel - 1);        
  Serial.println(")");        
}        
        
// Fonction pour appliquer l'octave web directement aux paramètres sensibles        
void applyWebOctave() {        
  if (selectedPreset == 0 && webModeActive) {        
    // Appliquer l'octave au pitch (paramètre 1)        
    int pitchValue = (int)parameters[1].value + (webOctave * transpose_factor);        
    if (pitchValue < 0) pitchValue = 0;        
    if (pitchValue > 255) pitchValue = 255;        
    dmxValues[parameters[1].dmxChannel - 1] = (uint8_t)pitchValue;        
            
    // Appliquer l'octave au gate_threshold (paramètre 7)        
    int gateValue = (int)parameters[7].value + (webOctave * transpose_factor);        
    if (gateValue < 0) gateValue = 0;        
    if (gateValue > 255) gateValue = 255;        
    dmxValues[parameters[7].dmxChannel - 1] = (uint8_t)gateValue;        
            
    // Debug supprimé pour améliorer les performances        
  }        
}        
        
// Fonction pour obtenir la valeur d'un paramètre par son nom        
uint8_t getParameter(const char* paramName) {        
  for (int i = 0; i < PRESET_SIZE; i++) {        
    if (strcmp(parameters[i].name, paramName) == 0) {        
      return parameters[i].value;        
    }        
  }        
  return 0;        
}        
        
// Variables globales pour stocker les liens des contrôles physiques        
// REMOVED: Les liens sont maintenant lus dynamiquement depuis le preset actuel        
        
// Fonction pour mettre à jour les liens des contrôles physiques depuis le preset actuel        
// REMOVED: Plus nécessaire car les liens sont lus à chaque appel        
        
// Fonction pour sauvegarder un preset        
void savePreset(uint8_t presetIndex, const char* presetName) {        
  if (presetIndex >= MAX_PRESETS) {        
    Serial.println("Index de preset invalide");        
    return;        
  }        
          
