gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Fonction pour lire les faders        
void readFaders() {        
  faderValues[0] = analogRead(FADER_1_PIN) / 16; // 0-4095 -> 0-255        
  faderValues[1] = analogRead(FADER_2_PIN) / 16;        
  faderValues[2] = analogRead(FADER_3_PIN) / 16;        
          
  // Mise à jour des paramètres selon les faders        
  if (faderValues[0] != lastFaderValues[0]) {        
    setParameter("filter_cutoff", faderValues[0]);        
    lastFaderValues[0] = faderValues[0];        
  }        
          
  if (faderValues[1] != lastFaderValues[1]) {        
    setParameter("filter_reso", faderValues[1]);        
    lastFaderValues[1] = faderValues[1];        
  }        
          
  if (faderValues[2] != lastFaderValues[2]) {        
    setParameter("delay_time", faderValues[2]);        
    lastFaderValues[2] = faderValues[2];        
  }        
}        
        
// Fonction pour gérer les boutons push        
void handleButtons() {        
  // Lecture des boutons        
  bool button1State = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP        
  bool button2State = !digitalRead(BUTTON_2_PIN);        
  bool button3State = !digitalRead(BUTTON_3_PIN);        
          
  // Bouton 1 - Décrémenter preset avec debounce
  if (button1State && !lastButtonStates[0] && (millis() - lastButton1Press > BUTTON_DEBOUNCE_TIME)) {
    if (selectedWebPreset > 1) {
      selectedWebPreset--;
    } else {
      selectedWebPreset = 8; // Boucler vers P8 quand on est en P1
    }
    loadWebPresetUnified(selectedWebPreset - 1); // Convertir 1-8 en 0-7
    Serial.print("Bouton 1 - Web preset descendu et chargé: P");
    Serial.println(selectedWebPreset);
    displayUnified();
    lastButton1Press = millis();
  }
  
  // Bouton 2 - Incrémenter preset avec debounce
  if (button2State && !lastButtonStates[1] && (millis() - lastButton2Press > BUTTON_DEBOUNCE_TIME)) {
    if (selectedWebPreset < 8) {
      selectedWebPreset++;
    } else {
      selectedWebPreset = 1; // Boucler vers P1 quand on est en P8
    }
    loadWebPresetUnified(selectedWebPreset - 1); // Convertir 1-8 en 0-7
    Serial.print("Bouton 2 - Web preset monté et chargé: P");
    Serial.println(selectedWebPreset);
    displayUnified();
    lastButton2Press = millis();
  }
          
  // Bouton 3 - Gestion mute/unmute et delay feedback        
  // Détecter le début d'un appui (front montant)
  if (button3State && !lastButtonStates[2]) {        
    button3PressStartTime = millis();        
    button3LongPress = false;
  }        
  
  // Détecter la fin d'un appui (front descendant)
  if (!button3State && lastButtonStates[2]) {        
    unsigned long pressDuration = millis() - button3PressStartTime;        
    
    if (pressDuration < LONG_PRESS_DURATION) {        
      // Clic court : toggle mute/unmute        
      muteMode = !muteMode;        
      Serial.print("Bouton 3 - Mode mute ");        
      Serial.println(muteMode ? "ACTIVÉ" : "DÉSACTIVÉ");        
      displayUnified(); // Mettre à jour l'affichage pour montrer/cacher "MutE"
    }        
    
    // Réinitialiser le flag de clic long quand on relâche        
    button3LongPress = false;        
  }        
  
  // Détecter le clic long pendant qu'on maintient le bouton        
  if (button3State && (millis() - button3PressStartTime >= LONG_PRESS_DURATION) && !button3LongPress) {        
    button3LongPress = true;        
    Serial.println("Bouton 3 - Clic long : delay feedback MAX");        
  }        
  
  lastButtonStates[0] = button1State;        
  lastButtonStates[1] = button2State;        
  lastButtonStates[2] = button3State;        
}        
        
        
// Fonction pour gérer les boutons avec interruptions        
void handleButtonInterrupts() {        
  // Les boutons 1 et 2 sont maintenant gérés par polling dans handleButtons()
  // pour éviter les problèmes de debounce des interruptions
  
  // Traiter les interruptions du bouton 3 (gestion mute/delay feedback)        
  if (buttonInterruptFlags[2]) {        
    // Cette fonction est maintenant gérée dans handleButtons() pour le clic long
    buttonInterruptFlags[2] = false;        
  }        
}        
        
        
// Fonction pour gérer l'encodeur KY-040 - Système unifié web presets        
void handleEncoder() {        
  // *** NAVIGATION PAR ROTATION DÉSACTIVÉE ***
  // L'encodeur rotatif est défaillant et interfère avec la navigation par boutons
  // On garde seulement le bouton de l'encodeur pour charger les presets
  
  // int32_t currentEncoderValue = - encoder.getCount();        
  // int32_t normalizedValue = abs(currentEncoderValue / 2);        
  // uint8_t newWebPreset = (normalizedValue % 8) + 1; // 1-8        
  // if (newWebPreset != selectedWebPreset) {        
  //   selectedWebPreset = newWebPreset;        
  //   displayUnified();        
  //   Serial.print("🔄 Preset web sélectionné: P");        
  //   Serial.println(selectedWebPreset);        
  // }        
          
  // Gestion du bouton de l'encodeur (charger le preset sélectionné)        
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);        
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {        
    // Charger le preset web sélectionné        
    loadWebPresetUnified(selectedWebPreset - 1); // Convertir 1-8 en 0-7        
            
    encoderButtonPressed = true;        
    lastEncoderButtonPress = millis();        
  }        
          
  if (!encoderButtonState) {        
    encoderButtonPressed = false;        
  }        
}        
        
// Fonction pour afficher l'octave et le preset web de manière unifiée        
void displayUnified() {        
  // Vérifier si on est en mode mute
  if (muteMode) {
    // Afficher "MutE"
    uint8_t muteSegments[4] = {
      0x54, // M
      0x1C, // u 
      0x78, // t
      0x79  // E
    };
    display.setSegments(muteSegments);
    return;
  }
          
  // Format unifié: OOPP où OO = octave (-12 à +12) et PP = preset web (P1-P8)        
  // Exemples:         
  // - Octave +5, preset 3 → " 5P3"         
  // - Octave -2, preset 7 → "-2P7"        
  // - Octave 0, preset 1 → " 0P1"        
          
  uint8_t segments[4] = {0, 0, 0, 0};        
          
  // Utiliser toujours l'octave web (système unifié)        
  int8_t displayValue = webOctave;        
          
