gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Calcul pour les digits de l'octave (positions 0 et 1)        
  if (displayValue == 0) {        
    // Valeur = 0 : afficher " 0"        
    segments[0] = 0x00; // Espace        
    segments[1] = display.encodeDigit(0);        
  } else if (displayValue > 0) {        
    // Valeur positive : afficher directement le nombre        
    if (displayValue >= 10) {        
      segments[0] = display.encodeDigit(displayValue / 10);        
      segments[1] = display.encodeDigit(displayValue % 10);        
    } else {        
      segments[0] = 0x00; // Espace        
      segments[1] = display.encodeDigit(displayValue);        
    }        
  } else {        
    // Valeur négative : afficher "-" + valeur absolue        
    segments[0] = 0x40; // Segment "-"        
    int absValue = -displayValue;        
    segments[1] = display.encodeDigit(absValue);        
  }        
          
  // Calcul pour les digits du preset (positions 2 et 3)        
  segments[2] = 0x73; // Segment "P"        
  segments[3] = display.encodeDigit(selectedWebPreset);        
          
  // Afficher les segments        
  display.setSegments(segments);        
}        
        
// Fonction pour mettre à jour l'afficheur TM1637        
void updateDisplay() {        
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {        
    // Utiliser la nouvelle fonction d'affichage unifiée        
    displayUnified();        
    lastDisplayUpdate = millis();        
  }        
}        
        
void setup()        
{        
  Serial.begin(115200);        
  Serial.println("=== Contrôleur Interactif ESP32 ===");        
  Serial.println("Initialisation...");        
          
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques        
  btStop();        
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");        
          
  // Afficher l'adresse MAC de l'ESP32        
  Serial.print("Adresse MAC ESP32: ");        
  Serial.println(WiFi.macAddress());        
          
  // Initialisation du tableau DMX à 0        
  for (int i = 0; i < 512; i++) {        
    dmxValues[i] = 0;        
  }        
          
  // Initialisation des paramètres        
  initializeParameters();        
          
  // Initialisation des presets        
  initializePresets();        
          
  // Chargement du preset 1 au démarrage        
  loadPreset(1);        
  selectedPreset = 1; // S'assurer que selectedPreset est correct        
          
  // Initialisation de l'interface utilisateur        
  initializeUserInterface();        
          
  // Affichage initial unifié        
  displayUnified();        
          
  // Configuration ESP-NOW        
  WiFi.mode(WIFI_STA);        
          
  if (esp_now_init() != ESP_OK) {        
    Serial.println("Erreur d'initialisation ESP-NOW");        
    return;        
  }        
          
  esp_now_register_send_cb(OnDataSent);        
        
          
  // Configuration du peer récepteur ESP8266 (unicast au lieu de broadcast)        
  memcpy(peerInfo.peer_addr, receiverAddress, 6);        
  peerInfo.channel = 0;        
  peerInfo.encrypt = false;        
          
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {        
    Serial.println("Erreur d'ajout du peer");        
    return;        
  }        
          
        
          
  Serial.println("ESP-NOW initialisé");        
  Serial.println("Mode: Unicast vers récepteur ESP8266");        
  Serial.print("Adresse MAC cible: ");        
  for (int i = 0; i < 6; i++) {        
    Serial.print(receiverAddress[i], HEX);        
    if (i < 5) Serial.print(":");        
  }        
  Serial.println();        
          
  // Initialisation de l'interface web        
  setupWebInterface();        
          
        
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");        
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");        
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");        
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");        
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");        
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");        
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");        
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");        
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");        
  Serial.println("Bouton 3: Trig HH");        
  Serial.println("Bouton encodeur: Toggle filtre ON/OFF");        
        
  Serial.println("Transposition actuelle: " + String(transpose) + " (├ù" + String(transpose_factor) + ")");        
  Serial.println("Transposition appliquée au pitch et gate_threshold");        
  Serial.println("================================");        
          
  // Initialiser le système unifié des presets web        
  webModeActive = true;        
  selectedPreset = 0; // Toujours en mode web        
  selectedWebPreset = 1; // Commencer avec P1 sélectionné        
  displayUnified(); // Afficher l'état initial        
          
  Serial.println("🎯 Système unifié activé - Utilisation exclusive des web presets");        
  Serial.print("🎵 Octave actuelle: ");        
  Serial.println(webOctave);        
  Serial.print("📋 Preset sélectionné: P");        
  Serial.println(selectedWebPreset);        
}        
        
void sendDMXvalues()        
{        
  // Appliquer les overrides avant l'envoi
  uint8_t originalMasterVolume = dmxValues[119]; // Canal DMX 120 (master_volume)
  uint8_t originalDelayFeedback = dmxValues[105]; // Canal DMX 106 (delay_feedback)
  
  // Override du master volume en mode mute (255 = mute car volume inversé)
  if (muteMode) {
    dmxValues[119] = 255;
  }
  
  // Override du delay feedback en clic long (255 = maximum)
  if (button3LongPress) {
    dmxValues[105] = 255;
  }
        
