gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Lecture des faders        
 // readFaders();        
          
  // Gestion des boutons push        
  handleButtonInterrupts();
  handleButtons();  // Gestion du bouton 3 (mute/unmute et clic long)
          
  // Gestion du serveur web (limité à 10Hz pour éviter la surcharge)        
  static unsigned long lastWebServerUpdate = 0;        
  if (millis() - lastWebServerUpdate >= 100) { // 100ms = 10Hz        
    webServer.handleClient();        
    lastWebServerUpdate = millis();        
  }        
          
  // Gestion de l'encodeur KY-040        
 // handleEncoder();        
          
  // Mise à jour de l'afficheur TM1637        
  updateDisplay();        
          
  // Émission à fréquence fixe (50Hz)        
  if (millis() - lastEmissionTime >= EMISSION_INTERVAL) {        
            
    setlights();        
    sendDMXvalues();        
    lastEmissionTime = millis();        
  }        
          
  delay(1); // Petit délai pour éviter de surcharger le CPU        
}        
        
// ============================================================================        
// IMPLÉMENTATION DES FONCTIONS DE L'INTERFACE WEB        
// ============================================================================        
        
// Initialisation du système de fichiers et du serveur web        
void setupWebInterface() {        
  // Initialiser le système de fichiers avec formatage forcé si nécessaire        
  Serial.println("Initialisation de LittleFS...");        
  if (!LittleFS.begin(true)) {        
    Serial.println("Première tentative échouée, formatage forcé...");        
    LittleFS.format();        
    if (!LittleFS.begin(true)) {        
      Serial.println("Erreur: Impossible d'initialiser LittleFS même après formatage");        
      return;        
    }        
  }        
  Serial.println("LittleFS initialisé avec succès");        
          
  // Vérifier que l'écriture fonctionne en créant un fichier de test        
  File testFile = LittleFS.open("/test.txt", "w");        
  if (testFile) {        
    testFile.println("Test d'écriture LittleFS");        
    testFile.close();        
    Serial.println("Test d'écriture LittleFS réussi");        
    LittleFS.remove("/test.txt"); // Nettoyer le fichier de test        
  } else {        
    Serial.println(" Erreur: Impossible d'écrire dans LittleFS");        
  }        
          
  // Lister les fichiers disponibles        
  File root = LittleFS.open("/");        
  File file = root.openNextFile();        
  Serial.println(" Fichiers disponibles dans LittleFS:");        
  while (file) {        
    Serial.print("  - ");        
    Serial.print(file.name());        
    Serial.print(" (");        
    Serial.print(file.size());        
    Serial.println(" bytes)");        
    file = root.openNextFile();        
  }        
          
  // Créer le point d'accès WiFi        
  WiFi.softAP(AP_SSID, AP_PASSWORD);        
  Serial.print("Point d'accès WiFi créé: ");        
  Serial.println(AP_SSID);        
  Serial.print("Mot de passe: ");        
  Serial.println(AP_PASSWORD);        
  Serial.print("Adresse IP: ");        
  Serial.println(WiFi.softAPIP());        
          
  // Configurer les routes du serveur web        
  setupWebRoutes();        
          
  // Démarrer le serveur web        
  webServer.begin();        
  Serial.println("Serveur web démarré");        
          
  // Initialiser les tableaux de presets web        
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {        
    webPresets[i].name[0] = '\0'; // Marquer les slots comme vides        
    webPresets[i].octave = 0;     // Initialiser l'octave à 0        
  }        
          
  // Charger les presets web et assignations        
  Serial.println("Début du chargement des presets web...");        
  loadWebPresets();
  
  // Initialiser les presets vides si aucun preset n'existe
  if (webPresetCount == 0) {
    Serial.println("Aucun preset trouvé - Initialisation des presets vides...");
    initializeEmptyWebPresets();
  }
  
  Serial.println("Début du chargement des assignations web...");        
  loadWebAssignments();        
}        
        
// Configuration des routes du serveur web        
void setupWebRoutes() {        
  // Redirection automatique de la racine vers index.html        
  webServer.on("/", HTTP_GET, []() {        
    webServer.sendHeader("Location", "/index.html", true);        
    webServer.send(302, "text/plain", "Redirection vers l'interface web...");        
  });        
          
  // Route de test simple (pour vérifier que le serveur fonctionne)        
  webServer.on("/test", HTTP_GET, []() {        
    String html = "<!DOCTYPE html><html><body>";        
    html += "<h1>Test DMX Controller</h1>";        
    html += "<p>Le serveur web fonctionne !</p>";        
    html += "<p>Fichiers LittleFS:</p><ul>";        
            
    File root = LittleFS.open("/");        
    File file = root.openNextFile();        
    while (file) {        
      html += "<li>" + String(file.name()) + " (" + String(file.size()) + " bytes)</li>";        
      file = root.openNextFile();        
    }        
    html += "</ul>";        
        
    html += "</body></html>";        
            
    webServer.send(200, "text/html", html);        
  });        
          
        
          
  // API pour récupérer les paramètres        
  webServer.on("/api/parameters", HTTP_GET, handleGetParameters);        
          
  // API pour mettre à jour un paramètre        
  webServer.on("/api/parameters", HTTP_POST, handleUpdateParameter);        
          
  // API pour récupérer les assignations        
  webServer.on("/api/assignments", HTTP_GET, handleGetAssignments);        
          
  // API pour mettre à jour les assignations        
  webServer.on("/api/assignments", HTTP_POST, handleUpdateAssignments);        
          
  // API pour sauvegarder un preset web        
  webServer.on("/api/save-preset", HTTP_POST, handleSaveWebPreset);        
          
  // API pour charger un preset web        
  webServer.on("/api/load-preset", HTTP_POST, handleLoadWebPreset);        
          
  // API pour lister les presets web        
  webServer.on("/api/presets", HTTP_GET, handleListWebPresets);        
          
  // API pour gérer les octaves        
  webServer.on("/api/octave", HTTP_POST, handleOctave);        
  
  // API pour exporter/importer les presets
  webServer.on("/api/export-presets", HTTP_GET, handleExportPresets);
  webServer.on("/api/import-presets", HTTP_POST, handleImportPresets);
          
