gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // API pour vérifier les changements physiques - DÉSACTIVÉ (trop lourd)       
  // webServer.on("/api/status", HTTP_GET, handleGetStatus);        
          
  // Servir les fichiers statiques depuis LittleFS (APRÈS les APIs)        
  webServer.serveStatic("/", LittleFS, "/");        
          
  // Gestion des erreurs 404        
  webServer.onNotFound(handleNotFound);        
}        
        
// API: Récupérer le statut système        
void handleGetStatus() {        
  Serial.println("DEBUG: handleGetStatus() appelée");        
  DynamicJsonDocument doc(512);        
  doc["lastPhysicalPresetChange"] = lastPhysicalPresetChange;        
  doc["selectedWebPreset"] = selectedWebPreset;        
  doc["webOctave"] = webOctave;        
  doc["lastWebPreset"] = lastWebPreset;        
          
  String response;        
  serializeJson(doc, response);        
  Serial.println("DEBUG: Status response: " + response);        
  webServer.send(200, "application/json", response);        
}        
        
// API: Récupérer les paramètres        
void handleGetParameters() {        
  Serial.println("DEBUG: GET /api/parameters - Début");        
          
  DynamicJsonDocument doc(1024);        
  JsonArray paramsArray = doc.createNestedArray("parameters");        
          
  // Envoyer les 27 paramètres web (0-20: audio, 21-23: filter, 24-26: rgb1)        
  // Si on est en mode web (preset 0), utiliser les valeurs des paramètres        
  // Sinon, utiliser les valeurs du preset actuel        
  if (selectedPreset == 0) {        
    for (int i = 0; i < 27; i++) {        
      paramsArray.add(parameters[i].value);        
    }        
  } else {        
    for (int i = 0; i < 27; i++) {        
      paramsArray.add(presets[selectedPreset].values[i]);        
    }        
  }        
          
  String response;        
  serializeJson(doc, response);        
          
  Serial.println("DEBUG: GET /api/parameters - Réponse envoyée: " + response);        
  webServer.send(200, "application/json", response);        
}        
        
// API: Mettre à jour un paramètre        
void handleUpdateParameter() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    int id = doc["id"];        
    int value = doc["value"];        
            
    if (id >= 0 && id < 27 && value >= 0 && value <= 255) {        
      parameters[id].value = value;        
      dmxValues[parameters[id].dmxChannel - 1] = value;        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Paramètre mis à jour";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Paramètres invalides\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Récupérer les assignations        
void handleGetAssignments() {        
  Serial.println("≡ƒöù GET /api/assignments - Début");        
          
  DynamicJsonDocument doc(512);        
  JsonArray assignmentsArray = doc.createNestedArray("assignments");        
          
  for (int i = 0; i < 4; i++) {        
    assignmentsArray.add(webAssignments[i]);        
  }        
          
  String response;        
  serializeJson(doc, response);        
          
  Serial.println("≡ƒöù GET /api/assignments - Réponse envoyée: " + response);        
  webServer.send(200, "application/json", response);        
}        
        

// API: Mettre à jour les assignations        
void handleUpdateAssignments() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(512);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    int index = doc["index"];        
    int value = doc["value"];        
            
    if (index >= 0 && index < 4 && value >= 0 && value <= 23) {        
      webAssignments[index] = value;        
      saveWebAssignments();        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Assignation mise à jour";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Paramètres invalides\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
// API: Sauvegarder un preset web        
void handleSaveWebPreset() {        
  if (webServer.hasArg("plain")) {        
    DynamicJsonDocument doc(2048);        
    deserializeJson(doc, webServer.arg("plain"));        
            
    const char* name = doc["name"];        
    JsonArray values = doc["values"];        
    JsonArray assignments = doc["assignments"];        
    int slot = doc["slot"]; // Nouveau : index du slot où sauvegarder        
            
    if (slot >= 0 && slot < MAX_WEB_PRESETS && values.size() == 27) {        
      strcpy(webPresets[slot].name, name);        
              
      for (int i = 0; i < 27; i++) {        
        webPresets[slot].values[i] = values[i];        
      }        
              
      // Sauvegarder l'octave web actuelle        
      webPresets[slot].octave = webOctave;        
              
      // Sauvegarder les assignations physiques reçues        
      if (assignments.size() == 4) {        
        for (int i = 0; i < 4; i++) {        
          webPresets[slot].assignments[i] = assignments[i];        
        }        
      } else {        
        // Fallback : utiliser les assignations actuelles si pas reçues        
        for (int i = 0; i < 4; i++) {        
          webPresets[slot].assignments[i] = webAssignments[i];        
        }        
      }        
              
      // Recalculer webPresetCount correctement (compter tous les presets avec un nom)
      webPresetCount = 0;
      for (int i = 0; i < MAX_WEB_PRESETS; i++) {
        if (strlen(webPresets[i].name) > 0) {
          webPresetCount++;
        }
      }
              
      saveWebPresets();        
              
      DynamicJsonDocument response(128);        
      response["success"] = true;        
      response["message"] = "Preset sauvegardé";        
              
      String responseStr;        
      serializeJson(response, responseStr);        
      webServer.send(200, "application/json", responseStr);        
    } else {        
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Slot invalide ou données incorretes\"}");        
    }        
  } else {        
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");        
  }        
}        
        
