gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    // Initialiser les assignations à OFF
    for (int j = 0; j < 4; j++) {
      webPresets[i].assignments[j] = 0;
    }
  }
  
  webPresetCount = MAX_WEB_PRESETS;
  saveWebPresets();
  
  Serial.println("✅ 8 presets vides initialisés");
}

// Fonction pour charger un preset web avec affichage unifié        
void loadWebPresetUnified(int presetIndex) {        
  // Vérifier que le preset existe (on ignore webPresetCount et on vérifie directement le nom)       
  if (presetIndex < 0 || presetIndex >= MAX_WEB_PRESETS || 
      strlen(webPresets[presetIndex].name) == 0) {        
    Serial.print("❌ Preset web P");        
    Serial.print(presetIndex + 1);        
    Serial.println(" n'existe pas ou est vide");        
    return;        
  }        
          
  // Affichage "LOAd" supprimé - affichage direct du preset
  lastPhysicalPresetChange = millis(); // Marquer le changement physique        
          
  // Appliquer les valeurs du preset        
  for (int i = 0; i < 27; i++) {        
    parameters[i].value = webPresets[presetIndex].values[i];        
    dmxValues[parameters[i].dmxChannel - 1] = webPresets[presetIndex].values[i];        
  }
  
  // IMPORTANT: Conversion du mode filtre pour Filter On-Off (comme dans l'interface web)
  uint8_t filterModeValue = webPresets[presetIndex].values[23]; // Filter Mode
  uint8_t filterOnOffValue = (filterModeValue > 0) ? 255 : 0;   // 255 si filtre actif, 0 si OFF
  
  // Appliquer la valeur convertie
  parameters[20].value = filterOnOffValue;  // Filter On-Off = paramètre 20
  dmxValues[parameters[20].dmxChannel - 1] = filterOnOffValue;
  
  Serial.print("DEBUG: Conversion filtre - Mode: ");
  Serial.print(filterModeValue);
  Serial.print(" -> Filter On-Off: ");
  Serial.println(filterOnOffValue);        
          
  // Charger l'octave du preset        
  webOctave = webPresets[presetIndex].octave;        
          
  // Charger les assignations physiques du preset        
  for (int i = 0; i < 4; i++) {        
    webAssignments[i] = webPresets[presetIndex].assignments[i];        
  }        
          
  // Sauvegarder les assignations web mises à jour        
  saveWebAssignments();        
          
  // Appliquer l'octave aux paramètres sensibles        
  applyWebOctave();        
          
  // Mettre à jour le dernier preset web utilisé        
  lastWebPreset = presetIndex;        
  
  // Mettre à jour le preset web sélectionné (pour l'affichage et les boutons)
  selectedWebPreset = presetIndex + 1; // Convertir 0-7 en 1-8
          
  // Sauvegarder l'état dans le preset 0 pour persistance        
  saveWebStateToPreset0();        
          
  // Debug        
  Serial.print("✅ Preset web P");        
  Serial.print(presetIndex + 1);        
  Serial.print(" chargé: ");        
  Serial.println(webPresets[presetIndex].name);        
    Serial.print("🎵 Octave: ");        
  Serial.println(webOctave);        
}

// API: Exporter tous les presets vers un fichier JSON téléchargeable
void handleExportPresets() {
  Serial.println("DEBUG: Exportation des presets...");
  
  DynamicJsonDocument doc(8192);
  doc["version"] = "v028";
  doc["timestamp"] = String(millis());
  doc["preset_count"] = webPresetCount;
  
  JsonArray presetsArray = doc.createNestedArray("presets");
  
  for (int i = 0; i < MAX_WEB_PRESETS; i++) {
    JsonObject preset = presetsArray.createNestedObject();
    preset["slot"] = i;
    preset["name"] = webPresets[i].name;
    preset["octave"] = webPresets[i].octave;
    
    JsonArray valuesArray = preset.createNestedArray("values");
    for (int j = 0; j < 27; j++) {
      valuesArray.add(webPresets[i].values[j]);
    }
    
    JsonArray assignmentsArray = preset.createNestedArray("assignments");
    for (int j = 0; j < 4; j++) {
      assignmentsArray.add(webPresets[i].assignments[j]);
    }
  }
  
  String jsonString;
  serializeJson(doc, jsonString);
  
  // Générer un nom de fichier avec timestamp
  String timestamp = String(millis());
  String filename = "ksoloti_presets_" + timestamp + ".json";
  
  webServer.sendHeader("Content-Disposition", "attachment; filename=\"" + filename + "\"");
  webServer.send(200, "application/json", jsonString);
  
  Serial.println("✅ Presets exportés: " + filename);
}

// API: Importer des presets depuis un fichier JSON uploadé
void handleImportPresets() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(8192);
    DeserializationError error = deserializeJson(doc, webServer.arg("plain"));
    
    if (error) {
      Serial.println("❌ Erreur parsing JSON: " + String(error.c_str()));
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Format JSON invalide\"}");
      return;
    }
    
    // Vérifier la validité du fichier
    if (!doc.containsKey("presets") || !doc["presets"].is<JsonArray>()) {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Format de preset invalide\"}");
      return;
    }
    
    JsonArray presetsArray = doc["presets"];
    int importedCount = 0;
    
    // Importer chaque preset
    for (JsonObject preset : presetsArray) {
      int slot = preset["slot"] | -1;
      
      if (slot >= 0 && slot < MAX_WEB_PRESETS) {
        const char* name = preset["name"] | "";
        if (strlen(name) > 0) {
          strcpy(webPresets[slot].name, name);
          webPresets[slot].octave = preset["octave"] | 0;
          
          JsonArray valuesArray = preset["values"];
          int i = 0;
          for (JsonVariant value : valuesArray) {
            if (i < 27) {
              webPresets[slot].values[i] = value | 0;
              i++;
            }
          }
          
          JsonArray assignmentsArray = preset["assignments"];
          int j = 0;
          for (JsonVariant assignment : assignmentsArray) {
            if (j < 4) {
              webPresets[slot].assignments[j] = assignment | 0;
              j++;
            }
          }
          
          importedCount++;
        }
      }
    }
    
    // Mettre à jour le compteur et sauvegarder
    if (importedCount > 0) {
      // Forcer la suppression de l'ancien fichier pour éviter les problèmes de cache
      LittleFS.remove("/web_presets.json");
      Serial.println("🗑️ Ancien fichier presets supprimé");
      
      webPresetCount = MAX_WEB_PRESETS; // Assumer tous les slots sont utilisés
      saveWebPresets();
      
      DynamicJsonDocument response(256);
      response["success"] = true;
      response["message"] = "Presets importés avec succès";
      response["imported_count"] = importedCount;
      
      String responseStr;
      serializeJson(response, responseStr);
      webServer.send(200, "application/json", responseStr);
      
      Serial.println("✅ " + String(importedCount) + " presets importés");
    } else {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Aucun preset valide trouvé\"}");
    }
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}
        
        